Public Attributes | List of all members
API_GeoReferenceData Struct Reference
Geolocation
Coordinate Reference System and Map Conversion parameters of the Geo Location of the project. More...
#include <APIdefs_Environment.h>
 Public Attributes
GS::UniString  | name
Name by which the coordinate reference system is identified.
GS::UniString  | description
Informal description of this coordinate reference system.
GS::UniString  | geodeticDatum
Name by which this datum is identified.
GS::UniString  | verticalDatum
Name by which the vertical datum is identified.
GS::UniString  | mapProjection
Name by which the map projection is identified.
GS::UniString  | mapZone
Name by which the map zone, relating to the MapProjection, is identified.
double  | eastings
Location along the easting of the coordinate system of the target map coordinate reference system.
double  | northings
Location along the northing of the coordinate system of the target map coordinate reference system.
double  | orthogonalHeight
Orthogonal height relative to the vertical datum specified.
double  | xAxisAbscissa
Value along the easting axis of the end point of a vector indicating the position of the local x axis of the engineering coordinate reference system.
double  | xAxisOrdinate
Value along the northing axis of the end point of a vector indicating the position of the local x axis of the engineering coordinate reference system.
double  | scale
Scale to be used, when the units of the CRS are not identical to the units of the engineering coordinate system.
Detailed Description
Coordinate Reference System and Map Conversion parameters of the Geo Location of the project.
Since
Archicad 25
Remarks
This structure is a member of API_GeoLocation. These Geo Referencing map parameters correspond to the IfcCoordinateReferenceSystem and IfcMapConversion entities of the IFC standard.
Member Data Documentation
◆ description
 API_GeoReferenceData::description
Informal description of this coordinate reference system.
◆ eastings
 API_GeoReferenceData::eastings
Location along the easting of the coordinate system of the target map coordinate reference system.
◆ geodeticDatum
 API_GeoReferenceData::geodeticDatum
Name by which this datum is identified.
◆ mapProjection
 API_GeoReferenceData::mapProjection
Name by which the map projection is identified.
◆ mapZone
 API_GeoReferenceData::mapZone
Name by which the map zone, relating to the MapProjection, is identified.
◆ name
 API_GeoReferenceData::name
Name by which the coordinate reference system is identified.
◆ northings
 API_GeoReferenceData::northings
Location along the northing of the coordinate system of the target map coordinate reference system.
◆ orthogonalHeight
 API_GeoReferenceData::orthogonalHeight
Orthogonal height relative to the vertical datum specified.
◆ scale
 API_GeoReferenceData::scale
Scale to be used, when the units of the CRS are not identical to the units of the engineering coordinate system.
◆ verticalDatum
 API_GeoReferenceData::verticalDatum
Name by which the vertical datum is identified.
◆ xAxisAbscissa
 API_GeoReferenceData::xAxisAbscissa
Value along the easting axis of the end point of a vector indicating the position of the local x axis of the engineering coordinate reference system.
◆ xAxisOrdinate
 API_GeoReferenceData::xAxisOrdinate
Value along the northing axis of the end point of a vector indicating the position of the local x axis of the engineering coordinate reference system.